# Intro a Pandas

Pandas es una librería de Python que nos permite trabajar con datos tabulares de manera muy eficiente. 

En el mundo del análisis de datos, Pandas se ha convertido en una herramienta fundamental para científicos de datos, analistas y cualquier persona que trabaje con datos en Python. Con Pandas, puedes realizar operaciones como limpieza, manipulación, visualización y análisis de datos de manera eficiente.

![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1920px-Pandas_logo.svg.png)

## 1. Instalar Pandas

Para instalar Pandas, ejecuta el siguiente comando en tu terminal:

```bash
pip install pandas==<version>
```

In [1]:
import pandas as pd

## 2. Series y Dataframes

Pandas tiene dos estructuras de datos principales: Series y DataFrames.

- **Series**: es un array unidimensional. Es similar a una columna en una tabla de Excel.
- **DataFrame**: es una estructura de datos bidimensional con filas y columnas con etiquetas. Es similar a una tabla de Excel.

### 2.1 Series

Para crear una Serie, puedes pasar una lista de elementos y Pandas creará una Serie con índices numéricos.

In [2]:
serie = pd.Series([0, 1, 2, 3, 4, 5])
serie

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

### 2.2 DataFrames

Para crear un DataFrame, puedes pasar un diccionario de listas, donde cada clave es el nombre de la columna y cada valor es una lista de elementos.

In [11]:
data = {
    'name': ['Manuel', 'Jose', 'Jean Paul', 'Roger', 'Juan Pablo'],
    'age': [16, 7, 29, None, 33], 
    'city': ['Madrid', 'Madrid', 'Málaga', 'Málaga', 'Puebla'],
    'height': [None, 1.20, 1.60, 2.01, 1.83]
}

df = pd.DataFrame(data)
df

         name   age    city  height
0      Manuel  16.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

Aunque lo más normal es crear DataFrames a partir de archivos CSV, Excel, bases de datos, etc. En este caso, vamos a guardar el DataFrame en un archivo CSV y posteriormente lo leeremos.

In [13]:
CSV_PATH = 'data.csv'

df.to_csv(CSV_PATH, index=False)

In [14]:
df

         name   age    city  height
0      Manuel  16.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

In [15]:
df = pd.read_csv(CSV_PATH)
df

         name   age    city  height
0      Manuel  15.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

## 3. Basics de un Dataframe

Podemos visualizar los primeros/últimos registros de un DataFrame con los métodos `head()` y `tail()`, respectivamente.

In [16]:
df.head(2)

     name   age    city  height
0  Manuel  15.0  Madrid     NaN
1    Jose   7.0  Madrid     1.2

In [17]:
df.tail(2)

         name   age    city  height
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

Los dataframes tienen una serie de atributos básicos: `.columns`, `.values`, `.shape`, `.dtypes`, etc. Algunos de ellos te recordarán a los atributos de un array de NumPy.

In [18]:
df.columns

Index(['name', 'age', 'city', 'height'], dtype='object')

In [19]:
df.values

array([['Manuel', 15.0, 'Madrid', nan],
       ['Jose', 7.0, 'Madrid', 1.2],
       ['Jean Paul', 29.0, 'Málaga', 1.6],
       ['Roger', nan, 'Málaga', 2.01],
       ['Juan Pablo', 33.0, 'Puebla', 1.83]], dtype=object)

In [20]:
df.shape

(5, 4)

In [21]:
df.dtypes

name       object
age       float64
city       object
height    float64
dtype: object

## 4. Estadísticas básicas

Pandas nos permite obtener la información general de un Dataframe con el método `info()`.

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    5 non-null      object
 3   height  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes



Pandas nos permite obtener estadísticas básicas de un DataFrame con el método `describe()`. Este método nos devuelve un resumen de las estadísticas descriptivas de las **columnas numéricas**.

In [23]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.000000  1.660000
std    12.110601  0.349571
min     7.000000  1.200000
25%    13.000000  1.500000
50%    22.000000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

## 5. Indexación

Recordemos que el indexing consiste en seleccionar un subconjunto de datos de un DataFrame. Recordemos antes cómo era el dataframe original y veamos que Pandas nos permite indexar un DataFrame de diferentes maneras.

In [24]:
df

         name   age    city  height
0      Manuel  15.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83


**Por nombre de columna**: `df['column_name']`

In [26]:
df['age']

0    15.0
1     7.0
2    29.0
3     NaN
4    33.0
Name: age, dtype: float64

In [27]:
df[["name", "age"]]

         name   age
0      Manuel  15.0
1        Jose   7.0
2   Jean Paul  29.0
3       Roger   NaN
4  Juan Pablo  33.0

In [ ]:
df.iloc[0]

         name   age    city  height
0      Manuel  15.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

**Por posición (índice) de la fila**: `df.iloc[0]`

In [31]:
df.iloc[0]

name      Manuel
age         15.0
city      Madrid
height       NaN
Name: 0, dtype: object

**Por etiqueta de la fila**: `df.loc['row_label']`

In [16]:
df.loc[0]  # en este caso, como los indices son los mismos que las posiciones, `loc` es lo mismo que `iloc`

name       María
age         16.0
city      Madrid
height       NaN
Name: 0, dtype: object

**Por etiqueta de fila y columna**: `df.loc['row_label', 'column_name']`

In [38]:
df.loc[0, 'name']

'Manuel'

**Por condición**: `df[df['column_name'] > 0]`

In [39]:
df

         name   age    city  height
0      Manuel  15.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

In [50]:
condition = df['age'] > 18
df[condition]

         name   age    city  height
2   Jean Paul  29.0  Málaga    1.60
4  Juan Pablo  33.0  Puebla    1.83

**Por valores mínimos y máximos**: `df['column_name'].idxmin()` y `df['column_name'].idxmax()`

In [53]:
df["age"].idxmax()

4

In [60]:
max_age_row_idx = df["age"].idxmax()
max_age_row = df.loc[max_age_row_idx]
max_age_row["name"]

'Juan Pablo'

## 6. Data Cleaning

El data cleaning es un paso fundamental en cualquier análisis de datos. Pandas nos permite realizar operaciones de limpieza de datos de manera muy eficiente. **Es muy común encontrarnos con valores nulos** en nuestros datasets. Pandas nos ofrece métodos para tratar estos valores nulos, como `dropna()`, `fillna()` y `isnull()`. Recordemos primero, el dataset original.

In [61]:
df

         name   age    city  height
0      Manuel  15.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

Por ejemplo, para ver si hay valores nulos en un DataFrame, podemos usar los metodos `isnull()` ó `isna()`.

In [ ]:
df.isnull()

    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Para **eliminar** las filas con valores nulos, podemos usar el método `dropna()`.

In [64]:
df.dropna()

         name   age    city  height
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
4  Juan Pablo  33.0  Puebla    1.83

Para **rellenar** los valores nulos con un valor específico, podemos usar el método `fillna()`.

In [ ]:
df.fillna(10)  # rellena los valores nulos con 0

         name   age    city  height
0      Manuel  15.0  Madrid   10.00
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger  10.0  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

Estos métodos son aplicables también a las Series (columnas de un DataFrame).

In [74]:
df['age'].fillna(10)

0    15.0
1     7.0
2    29.0
3    10.0
4    33.0
Name: age, dtype: float64

# Ejercicios

Toma el dataframe original y guárdalo como un CSV

In [80]:
df.to_csv("mi_csv.csv", index=False)

Ahora lee el archivo CSV

In [81]:
pd.read_csv("mi_csv.csv")

         name   age    city  height
0      Manuel  15.0  Madrid     NaN
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

Muestra los 3 primeros registros del DataFrame.

In [82]:
df.head(3)

        name   age    city  height
0     Manuel  15.0  Madrid     NaN
1       Jose   7.0  Madrid     1.2
2  Jean Paul  29.0  Málaga     1.6

Muestra los 4 últimos registros del DataFrame.

In [83]:
df.tail(4)

         name   age    city  height
1        Jose   7.0  Madrid    1.20
2   Jean Paul  29.0  Málaga    1.60
3       Roger   NaN  Málaga    2.01
4  Juan Pablo  33.0  Puebla    1.83

Dime cuantos datos tiene el DataFrame (💡 es lo mismo que calcular el número de filas). ¿en `numpy` vimos 2 formas de calcular este dato, recuerdas?

In [ ]:
df_length = df.shape[0]

(5, 4)

In [ ]:
df_length = len(df)

5

Muéstrame las estadísticas básicas del DataFrame.

In [ ]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.000000  1.660000
std    12.110601  0.349571
min     7.000000  1.200000
25%    13.000000  1.500000
50%    22.000000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

Obtén los datos de la columna 'name' ¿Cual es el tipo de dato de esta columna?

In [99]:
df["name"]

0        Manuel
1          Jose
2     Jean Paul
3         Roger
4    Juan Pablo
Name: name, dtype: object

🌶️ Recuera que una Serie se puede tratar como un array de numpy, por tanto, obtén los datos de la columna "age" y calcula la media. ¿Coincide con el resultado que arroja pandas en la celda superior? (💡 en `numpy` la media se calcula usando `np.mean`)

In [ ]:
import numpy as np

np.mean(df["age"])

np.float64(21.0)

In [103]:
df["age"].mean()

np.float64(21.0)

In [104]:
df["age"].median()

np.float64(22.0)

Ahora calcula la edad máxima y mínima de la columna "age".

In [105]:
df["age"].max(), df["age"].min()

(np.float64(33.0), np.float64(7.0))

🌶️ Una vez obtenida la edad mínima, ¿Cual es el nombre de dicha persona?

In [127]:
min_age = df["age"].min()
mask = df["age"] == min_age
df[mask]["name"]

1    Jose
Name: name, dtype: object

Filtra el DataFrame: muestra las filas donde la edad sea mayor a 25.

In [128]:
mask = df["age"] > 25
df[mask]

         name   age    city  height
2   Jean Paul  29.0  Málaga    1.60
4  Juan Pablo  33.0  Puebla    1.83

Filtra el DataFrame: muestra las filas donde la gente sea de 'Málaga'. (💡 utiliza el operador `==`)

🌶️ Filtra el Dataframe: filas donde la gente sea de 'Málaga' y mayor de 25. (💡 para sumar dos condiciones se utiliza el operador `and` que se representa en python con `&`, i.e.: 

```python
compose_condition = condition1 & condition2
```

Obtén la máscara de los valores que son nulos en el DataFrame.

In [129]:
df.isnull()

    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Ahora obtén la máscara de los valores que NO son nulos en el DataFrame. (💡 busca en la documentación de pandas, o en google, cómo hacerlo)

In [135]:
~df.isnull()

   name    age  city  height
0  True   True  True   False
1  True   True  True    True
2  True   True  True    True
3  True  False  True    True
4  True   True  True    True

Elimina los valores nulos del DataFrame.

Rellena todos los valores nulos con 1.

Ahora rellena sólo los valores nulos de la columna 'age' con 10.

🌶️ Ahora rellena los valores nulos de la columna 'height' con la media de dicha columna

## BONUS: Explora los datos del dataset de Titanic

El dataset de Titanic es un dataset muy famoso en el mundo del análisis de datos. Contiene información sobre los pasajeros del Titanic, incluyendo si sobrevivieron o no, su edad, sexo, clase, etc.

In [136]:
CSV_PATH = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

df = pd.read_csv(CSV_PATH)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Hazte preguntas como, ¿Qué porcentaje de pasajeros sobrevivió? ¿Cuál es la edad media de los pasajeros? ¿Cuántos pasajeros había en cada clase? ¿Cuál es la edad media de los pasajeros que sobrevivieron y de los que no? ¿Cuál es la edad máxima de los pasajeros que sobrevivieron y de los que no?